//有一个单链表的 head，我们想删除它其中的一个节点 node。
//
// 给你一个需要删除的节点 node 。你将 无法访问 第一个节点 head。 
//
// 链表的所有值都是 唯一的，并且保证给定的节点 node 不是链表中的最后一个节点。 
//
// 删除给定的节点。注意，删除节点并不是指从内存中删除它。这里的意思是： 
//
// 
// 给定节点的值不应该存在于链表中。 
// 链表中的节点数应该减少 1。 
// node 前面的所有值顺序相同。 
// node 后面的所有值顺序相同。 
// 
//
// 自定义测试： 
//
// 
// 对于输入，你应该提供整个链表 head 和要给出的节点 node。node 不应该是链表的最后一个节点，而应该是链表中的一个实际节点。 
// 我们将构建链表，并将节点传递给你的函数。 
// 输出将是调用你函数后的整个链表。 
// 
//
// 
//
// 示例 1： 
// 
// 
//输入：head = [4,5,1,9], node = 5
//输出：[4,1,9]
//解释：指定链表中值为 5 的第二个节点，那么在调用了你的函数之后，该链表应变为 4 -> 1 -> 9
// 
//
// 示例 2： 
// 
// 
//输入：head = [4,5,1,9], node = 1
//输出：[4,5,9]
//解释：指定链表中值为 1 的第三个节点，那么在调用了你的函数之后，该链表应变为 4 -> 5 -> 9 
//
// 
//
// 提示： 
//
// 
// 链表中节点的数目范围是 [2, 1000] 
// -1000 <= Node.val <= 1000 
// 链表中每个节点的值都是 唯一 的 
// 需要删除的节点 node 是 链表中的节点 ，且 不是末尾节点 
// 
//
// Related Topics链表 
//
// 👍 1281, 👎 0bug 反馈 | 使用指南 | 更多配套插件 
//
//
//
//


package com.rongsimin.leetcode.editor.cn;

/**
 * 237.删除链表中的节点
 *
 * @author rsm
 * @date 2023-08-22 10:40:00
 */
public class Q237DeleteNodeInALinkedList {
    public static void main(String[] args) {
        Solution solution = new Q237DeleteNodeInALinkedList().new Solution();
        ListNode head = new ListNode(new int[]{4, 5, 1, 9});
        ListNode node = head.next.next.next;
    }

    //leetcode submit region begin(Prohibit modification and deletion)

    /**
     * Definition for singly-linked list.
     * public class ListNode {
     * int val;
     * ListNode next;
     * ListNode(int x) { val = x; }
     * }
     */
    class Solution {
        /**
         * ，删除节点的代码是  node = node.next;
         * 这样做只是将传入的node变量指向了它的下一个节点，即将node节点的指针指向了节点3。但是这并没有对原链表产生任何影响，原链表仍然是：1 -> 2 -> 3 -> 4。
         * 尽管我们在方法内部改变了node变量的指向，但是这个改变并不会影响到原链表。
         * @param node
         */
        public void deleteNode2(ListNode node) {
            node = node.next;
        }
        public void deleteNode(ListNode node) {
            node.val = node.next.val;
            node.next = node.next.next;
        }
    }
//leetcode submit region end(Prohibit modification and deletion)

}